/**
 * FileName: GsonFormatEntity
 * Author:   jack.xue
 * Date:     2019/7/22 16:39
 * Description:
 * History:
 * <author>          <time>          <version>          <desc>
 * jack.xue           2019/7/22           1.0.0              描述
 */
package cn.bw.fitzboot.enity;

/**
 * 〈TODO〉<br> 
 *
 * @author jack.xue
 * @create 2019/7/22
 * @since 1.0.0
 */
public class GsonFormatEntity {

    /**
     * code : 200
     * type : SUCCESS
     * message : {"summary":"{\"stat\": 0, \"message\": [\"6\\u670819\\u65e5\\uff0c\\u90ce\\u9152\\u5b98\\u7f51\\u53d1\\u5e03\\u58f0\\u660e\\u56de\\u5e94\\u201c\\u90ce\\u9152\\u5904\\u7f5a\\u7834\\u4ef7\\u7ecf\\u9500\\u5546\\u548c\\u7535\\u5546\\u5e73\\u53f0\\u201d\\u4e00\\u4e8b\\u3002\\u6b64\\u524d\\u6587\\u4ef6\\u663e\\u793a\\uff0c6\\u670816\\u65e5\\u51cc\\u6668\\uff0c\\u56e0\\u90ce\\u9152\\u201c\\u90e8\\u5206\\u7ecf\\u9500\\u5546\\u51fa\\u73b0\\u4e86\\u4e25\\u91cd\\u7684\\u7ebf\\u4e0a\\u7834\\u4ef7\\u8fdd\\u89c4\\u884c\\u4e3a\\uff0c\\u5bf9\\u5e02\\u573a\\u9020\\u6210\\u4e86\\u6076\\u52a3\\u5f71\\u54cd\\u201d\\uff0c\\u90ce\\u9152\\u7efc\\u5408\\u6e20\\u9053\\u4e8b\\u4e1a\\u90e8\\u4e0b\\u53d1\\u4e86\\u300a\\u5173\\u4e8e\\u4eac\\u4e1c\\u3001\\u5929\\u732b\\u7b49\\u90e8\\u5206\\u7ecf\\u9500\\u5546\\u7834\\u4ef7\\u8fdd\\u89c4\\u7684\\u5904\\u7406\\u901a\\u62a5\\u300b\\u3002\\u901a\\u62a5\\u663e\\u793a\\uff0c\\u7531\\u5317\\u4eac\\u5b9c\\u4fe1\\u79d1\\u521b\\u4f9b\\u8d27\\u4eac\\u4e1c\\u81ea\\u8425\\u548c\\u82cf\\u5b81\\u81ea\\u8425\\u7684\\u9752\\u82b1\\u90ce\\u7cfb\\u5217\\u4ea7\\u54c1\\u3001\\u7ea2\\u4e4b\\u6b23\\u4f9b\\u8d27\\u5929\\u732b\\u8d85\\u5e02\\u7684\\u9752\\u82b1\\u90ce\\u7cfb\\u5217\\u4ea7\\u54c1\\u53ca\\u90ce\\u724c\\u90ce\\u9152\\uff0c\\u4e25\\u91cd\\u7a81\\u7834\\u4e86\\u516c\\u53f8\\u4ef7\\u683c\\u5e95\\u7ebf\\uff0c\\u9274\\u4e8e\\u5176\\u53ca\\u65f6\\u53d1\\u73b0\\u5e76\\u5904\\u7406\\uff0c\\u7ed9\\u4e88\\u5404\\u81ea\\u6263\\u9664\\u8fdd\\u7ea6\\u91d110\\u4e07\\u5143\\u7684\\u5904\\u7f5a\\u3002\\u6839\\u636e5\\u670821\\u65e5\\u90ce\\u9152\\u9752\\u82b1\\u90ce\\u4e8b\\u4e1a\\u90e8\\u534e\\u5317\\u5927\\u533a\\u7684\\u901a\\u77e5\\uff0c53\\u5ea6\\u300144.8\\u5ea6\\u7684500ml\\u9752\\u82b1\\u90ce\\u56e2\\u8d2d\\u7edf\\u4e00\\u62a5\\u4ef7\\u4e0a\\u8c03\\u4e3a1059\\u5143/\\u74f6\\uff0c\\u6700\\u4f4e\\u6210\\u4ea4\\u4ef7959\\u5143/\\u74f6\\u3002\\\\n\" +                 \"\\u3000\\u3000\\u90ce\\u9152\\u7efc\\u5408\\u6e20\\u9053\\u4e8b\\u4e1a\\u90e8\\u7684\\u6587\\u4ef6\\u66dd\\u5149\\u540e\\uff0c\\u8fc5\\u901f\\u5f15\\u8d77\\u5173\\u6ce8\\u3002\\\\n\" +                 \"\\u3000\\u3000\\u9152\\u6c34\\u5206\\u6790\\u5e08\\u8521\\u5b66\\u98de\\u8868\\u793a\\uff0c\\u51fa\\u73b0\\u7efc\\u5408\\u6e20\\u9053\\u4e8b\\u4e1a\\u90e8\\u64c5\\u81ea\\u505a\\u51fa\\u5904\\u7f5a\\u51b3\\u5b9a\\u7684\\u539f\\u56e0\\uff0c\\u53ef\\u80fd\\u662f\\u56e0\\u4e3a\\u90ce\\u9152\\u4e00\\u76f4\\u5728\\u8fdb\\u884c\\u9752\\u82b1\\u90ce\\u7b49\\u4ea7\\u54c1\\u7684\\u4ef7\\u683c\\u521a\\u6027\\u7ba1\\u63a7\\uff0c\\u8fd9\\u662f\\u90ce\\u9152\\u7684\\u957f\\u671f\\u6838\\u5fc3\\u76ee\\u6807\\uff0c\\u4f01\\u4e1a\\u5185\\u90e8\\u6bd4\\u8f83\\u654f\\u611f\\uff0c\\u4f46\\u6b64\\u6b21\\u7efc\\u5408\\u6e20\\u9053\\u4e8b\\u4e1a\\u90e8\\u6709\\u77eb\\u6789\\u8fc7\\u6b63\\u7684\\u5acc\\u7591\\u3002\"]}","product":"{\"message\": [], \"stat\": 0, \"version\": \"v0.4.0.26\"}","concept":"{\"message\": [], \"stat\": 0}","emotional":"{\"message\": [{\"pos\": {\"2\": 0.9825, \"1\": 0.0, \"0\": 0.017500000000000005}}], \"stat\": 0, \"des\": 0}","argument_analyze":"{\"stat\": 0, \"message\": [{\"argument\": {\"ARG0\": {\"str\": \"\", \"comcode\": \"\", \"pcode\": \"\", \"abbr\": \"\", \"chiname\": \"\", \"position\": []}, \"ARG1\": {\"str\": \"\", \"comcode\": \"\", \"pcode\": \"\", \"abbr\": \"\", \"chiname\": \"\", \"position\": []}}, \"event\": []}]}","company":"{\"message\": [{\"com\": [{\"abbr\": \"京东世纪贸易\", \"code\": \"\", \"idx\": [{\"abs_sen_id\": 5, \"abs_cut_id\": 8}, {\"abs_sen_id\": 6, \"abs_cut_id\": 0}, {\"abs_sen_id\": 7, \"abs_cut_id\": 36}], \"mkt\": \"N\", \"comcode\": 872229, \"chiname\": \"北京京东世纪贸易有限公司\", \"sim\": 0.34375, \"kw\": [\"京东\"], \"is_source\": 0}], \"seg\": [\"郎酒\", \"回应\", \"\u201c\", \"处罚\", \"破价\", \"经销商\", \"和\", \"电商\", \"\u201d\", \" \", \"称\", \"渠道\", \"部门\", \"擅自决定\", \"#&#\", \"6月\", \"19日\", \"，\", \"郎酒\", \"官网\", \"发布声明\", \"回应\", \"\u201c\", \"郎酒\", \"处罚\", \"破价\", \"经销商\", \"和\", \"电商平台\", \"\u201d\", \"一事\", \"。\", \"郎酒\", \"解释\", \"称\", \"，\", \"该\", \"处罚\", \"行为\", \"是\", \"综合\", \"渠道\", \"事业部\", \"擅自决定\", \"，\", \"并\", \"未经\", \"公司\", \"同意\", \"和\", \"盖章\", \"发\", \"。\", \"目前\", \"公司\", \"已经\", \"否决\", \"这一\", \"做法\", \"，\", \"并\", \"进行\", \"内部\", \"追责\", \"处理\", \"。\", \"此前\", \"文件\", \"显示\", \"，\", \"6月\", \"16日\", \"凌晨\", \"，\", \"因\", \"郎酒\", \"\u201c\", \"部分\", \"经销商\", \"出现\", \"了\", \"严重\", \"的\", \"线上\", \"破价\", \"违规行为\", \"，\", \"对\", \"市场\", \"造成\", \"了\", \"恶劣影响\", \"\u201d\", \"，\", \"郎酒\", \"综合\", \"渠道\", \"事业部\", \"下发\", \"了\", \"《\", \"关于\", \"京东\", \"、\", \"天猫\", \"等\", \"部分\", \"经销商\", \"破价\", \"违规\", \"的\", \"处理\", \"通报\", \"》\", \"。\", \"通报\", \"显示\", \"，\", \"由\", \"北京\", \"宜信\", \"科创\", \"供货\", \"京东\", \"自营\", \"和\", \"苏宁\", \"自营\", \"的\", \"青花\", \"郎\", \"系列产品\", \"、\", \"红之欣\", \"供货\", \"天猫超市\", \"的\", \"青花\", \"郎\", \"系列产品\", \"及\", \"郎牌\", \"郎酒\", \"，\", \"严重\", \"突破\", \"了\", \"公司\", \"价格\", \"底线\", \"，\", \"鉴于\", \"其\", \"及时发现\", \"并\", \"处理\", \"，\", \"给予\", \"各自\", \"扣除\", \"违约金\", \"10万元\", \"的\", \"处罚\", \"。\", \"京东\", \"自营\", \"扣减\", \"年度\", \"规划\", \"费用\", \"总计\", \"100万元\", \"，\", \"天猫超市\", \"扣减\", \"年度\", \"规划\", \"费用\", \"总计\", \"60万元\", \"，\", \"苏宁\", \"自营\", \"扣减\", \"年度\", \"规划\", \"费用\", \"总计\", \"30万元\", \"。\", \"\\\", \"n\", \"\"\", \" \", \"+\", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \"\"\", \" \", \"新\", \"京报\", \"记者\", \"通过\", \"商品价格\", \"查询\", \"平台\", \"发现\", \"，\", \"在\", \"天猫超市\", \"与\", \"京东\", \"自营\", \"店中\", \"，\", \"青花\", \"郎\", \"53度\", \"500ml\", \"产品\", \"单\", \"瓶装\", \"的\", \"价格\", \"目前\", \"已经\", \"恢复\", \"至\", \"979元\", \"/\", \"瓶\", \"。\", \"而\", \"在\", \"618\", \"促销\", \"期间\", \"，\", \"一度\", \"下探\", \"到\", \"919元\", \"/\", \"瓶\", \"。\", \"\\\", \"n\", \"\"\", \" \", \"+\", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \"\"\", \" \", \"值得注意\", \"的\", \"是\", \"，\", \"在此之前\", \"，\", \"郎酒\", \"刚刚\", \"下达\", \"涨价\", \"通知\", \"，\", \"自\", \"6月\", \"1\", \"日起\", \"，\", \"53度\", \"青花\", \"郎\", \"、\", \"44.8度\", \"青花\", \"郎\", \"、\", \"39度\", \"青花\", \"郎\", \"的\", \"出厂价\", \"均\", \"上调\", \"79元\", \"/\", \"瓶\", \"。\", \"而\", \"根据\", \"5月\", \"21日\", \"郎酒\", \"青花\", \"郎\", \"事业部\", \"华北\", \"大区\", \"的\", \"通知\", \"，\", \"53度\", \"、\", \"44.8度\", \"的\", \"500ml\", \"青花\", \"郎\", \"团购\", \"统一\", \"报价\", \"上调\", \"为\", \"1059元\", \"/\", \"瓶\", \"，\", \"最低\", \"成交价\", \"959元\", \"/\", \"瓶\", \"。\", \"\\\", \"n\", \"\"\", \" \", \"+\", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \"\"\", \" \", \"郎酒\", \"综合\", \"渠道\", \"事业部\", \"的\", \"文件\", \"曝光\", \"后\", \"，\", \"迅速\", \"引起\", \"关注\", \"。\", \"郎酒\", \"也\", \"在\", \"6月\", \"19日\", \"发布声明\", \"回应\", \"，\", \"称\", \"对于\", \"上述\", \"经销商\", \"的\", \"处罚\", \"文件\", \"是\", \"综合\", \"渠道\", \"事业部\", \"的\", \"擅自决定\", \"，\", \"起草\", \"文稿\", \"未\", \"经过\", \"公司\", \"同意\", \"和\", \"盖章\", \"发出\", \"，\", \"公司\", \"规定\", \"所有\", \"对外\", \"文件\", \"须经\", \"公司\", \"审核\", \"同意\", \"并\", \"加盖\", \"公章\", \"方为\", \"有效\", \"。\", \"公司\", \"知悉\", \"后\", \"，\", \"否决\", \"了\", \"事业部\", \"的\", \"错误做法\", \"。\", \"郎酒\", \"对\", \"综合\", \"渠道\", \"事业部\", \"的\", \"这种\", \"行为\", \"进行\", \"了\", \"内部\", \"追责\", \"处理\", \"，\", \"要求\", \"所有\", \"部门\", \"必须\", \"依法\", \"、\", \"依规\", \"管理\", \"和\", \"经营\", \"市场\", \"。\", \"\\\", \"n\", \"\"\", \" \", \"+\", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \" \", \"\"\", \" \", \"酒水\", \"分析师\", \"蔡\", \"学飞\", \"表示\", \"，\", \"出现\", \"综合\", \"渠道\", \"事业部\", \"擅自\", \"做出\", \"处罚决定\", \"的\", \"原因\", \"，\", \"可能\", \"是因为\", \"郎酒\", \"一直\", \"在\", \"进行\", \"青花\", \"郎\", \"等\", \"产品\", \"的\", \"价格\", \"刚性\", \"管控\", \"，\", \"这是\", \"郎酒\", \"的\", \"长期\", \"核心\", \"目标\", \"，\", \"企业\", \"内部\", \"比较\", \"敏感\", \"，\", \"但\", \"此次\", \"综合\", \"渠道\", \"事业部\", \"有\", \"矫枉过正\", \"的\", \"嫌疑\", \"。\"]}], \"stat\": 0, \"version\": \"v0.5.5.7\"}","industry":"{\"message\": [], \"stat\": 0, \"version\": \"v0.4.0.9\"}","com_per_analysis":"{\"version\": \"v0.4.0.14\", \"stat\": 0, \"message\": [{\"com_list\": [{\"com\": \"京东世纪贸易\", \"code\": \"\", \"comcode\": 872229, \"chiname\": \"北京京东世纪贸易有限公司\", \"sentence\": [\"通报显示，由北京宜信科创供货京东自营和苏宁自营的青花郎系列产品、红之欣供货天猫超市的青花郎系列产品及郎牌郎酒，严重突破了公司价格底线，鉴于其及时发现并处理，给予各自扣除违约金10万元的处罚。\", \"京东自营扣减年度规划费用总计100万元，天猫超市扣减年度规划费用总计60万元，苏宁自营扣减年度规划费用总计30万元。\", \"\\\\n\" +                 \" 新京报记者通过商品价格查询平台发现，在天猫超市与京东自营店中，青花郎53度500ml产品单瓶装的价格目前已经恢复至979元/瓶。\"], \"sen_idx\": [5, 6, 7], \"pos\": [2, 2, 0], \"weight_list\": [{\"0\": 0.0372, \"1\": 0.0051, \"2\": 0.9577}, {\"0\": 0.298, \"1\": 0.1929, \"2\": 0.5091}, {\"0\": 0.6933, \"1\": 0.2049, \"2\": 0.1018}], \"general_pos\": 2, \"weights\": {\"0\": 0.1676, \"1\": 0.099, \"2\": 0.7334}}], \"per_list\": []}]}","event":"{\"message\": [{\"name\": \"\\u56de\\u590d\\u76d1\\u7ba1\\u5c42\", \"pos\": 0, \"cat\": \"\\u6f84\\u6e05\\u56de\\u590d\"}], \"stat\": 0}","match_people":"{\"stat\": 0, \"message\": [], \"version\": \"v0.5.5.2\"}","stock_clf":"[0]"}
     */

    private String code;
    private String type;
    private MessageBean message;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getType() {
        return type;
    }

    public void setType(String type) {
        this.type = type;
    }

    public MessageBean getMessage() {
        return message;
    }

    public void setMessage(MessageBean message) {
        this.message = message;
    }

    public static class MessageBean {
        /**
         * summary : {"stat": 0, "message": ["6\u670819\u65e5\uff0c\u90ce\u9152\u5b98\u7f51\u53d1\u5e03\u58f0\u660e\u56de\u5e94\u201c\u90ce\u9152\u5904\u7f5a\u7834\u4ef7\u7ecf\u9500\u5546\u548c\u7535\u5546\u5e73\u53f0\u201d\u4e00\u4e8b\u3002\u6b64\u524d\u6587\u4ef6\u663e\u793a\uff0c6\u670816\u65e5\u51cc\u6668\uff0c\u56e0\u90ce\u9152\u201c\u90e8\u5206\u7ecf\u9500\u5546\u51fa\u73b0\u4e86\u4e25\u91cd\u7684\u7ebf\u4e0a\u7834\u4ef7\u8fdd\u89c4\u884c\u4e3a\uff0c\u5bf9\u5e02\u573a\u9020\u6210\u4e86\u6076\u52a3\u5f71\u54cd\u201d\uff0c\u90ce\u9152\u7efc\u5408\u6e20\u9053\u4e8b\u4e1a\u90e8\u4e0b\u53d1\u4e86\u300a\u5173\u4e8e\u4eac\u4e1c\u3001\u5929\u732b\u7b49\u90e8\u5206\u7ecf\u9500\u5546\u7834\u4ef7\u8fdd\u89c4\u7684\u5904\u7406\u901a\u62a5\u300b\u3002\u901a\u62a5\u663e\u793a\uff0c\u7531\u5317\u4eac\u5b9c\u4fe1\u79d1\u521b\u4f9b\u8d27\u4eac\u4e1c\u81ea\u8425\u548c\u82cf\u5b81\u81ea\u8425\u7684\u9752\u82b1\u90ce\u7cfb\u5217\u4ea7\u54c1\u3001\u7ea2\u4e4b\u6b23\u4f9b\u8d27\u5929\u732b\u8d85\u5e02\u7684\u9752\u82b1\u90ce\u7cfb\u5217\u4ea7\u54c1\u53ca\u90ce\u724c\u90ce\u9152\uff0c\u4e25\u91cd\u7a81\u7834\u4e86\u516c\u53f8\u4ef7\u683c\u5e95\u7ebf\uff0c\u9274\u4e8e\u5176\u53ca\u65f6\u53d1\u73b0\u5e76\u5904\u7406\uff0c\u7ed9\u4e88\u5404\u81ea\u6263\u9664\u8fdd\u7ea6\u91d110\u4e07\u5143\u7684\u5904\u7f5a\u3002\u6839\u636e5\u670821\u65e5\u90ce\u9152\u9752\u82b1\u90ce\u4e8b\u4e1a\u90e8\u534e\u5317\u5927\u533a\u7684\u901a\u77e5\uff0c53\u5ea6\u300144.8\u5ea6\u7684500ml\u9752\u82b1\u90ce\u56e2\u8d2d\u7edf\u4e00\u62a5\u4ef7\u4e0a\u8c03\u4e3a1059\u5143/\u74f6\uff0c\u6700\u4f4e\u6210\u4ea4\u4ef7959\u5143/\u74f6\u3002\\n" +                 "\u3000\u3000\u90ce\u9152\u7efc\u5408\u6e20\u9053\u4e8b\u4e1a\u90e8\u7684\u6587\u4ef6\u66dd\u5149\u540e\uff0c\u8fc5\u901f\u5f15\u8d77\u5173\u6ce8\u3002\\n" +                 "\u3000\u3000\u9152\u6c34\u5206\u6790\u5e08\u8521\u5b66\u98de\u8868\u793a\uff0c\u51fa\u73b0\u7efc\u5408\u6e20\u9053\u4e8b\u4e1a\u90e8\u64c5\u81ea\u505a\u51fa\u5904\u7f5a\u51b3\u5b9a\u7684\u539f\u56e0\uff0c\u53ef\u80fd\u662f\u56e0\u4e3a\u90ce\u9152\u4e00\u76f4\u5728\u8fdb\u884c\u9752\u82b1\u90ce\u7b49\u4ea7\u54c1\u7684\u4ef7\u683c\u521a\u6027\u7ba1\u63a7\uff0c\u8fd9\u662f\u90ce\u9152\u7684\u957f\u671f\u6838\u5fc3\u76ee\u6807\uff0c\u4f01\u4e1a\u5185\u90e8\u6bd4\u8f83\u654f\u611f\uff0c\u4f46\u6b64\u6b21\u7efc\u5408\u6e20\u9053\u4e8b\u4e1a\u90e8\u6709\u77eb\u6789\u8fc7\u6b63\u7684\u5acc\u7591\u3002"]}
         * product : {"message": [], "stat": 0, "version": "v0.4.0.26"}
         * concept : {"message": [], "stat": 0}
         * emotional : {"message": [{"pos": {"2": 0.9825, "1": 0.0, "0": 0.017500000000000005}}], "stat": 0, "des": 0}
         * argument_analyze : {"stat": 0, "message": [{"argument": {"ARG0": {"str": "", "comcode": "", "pcode": "", "abbr": "", "chiname": "", "position": []}, "ARG1": {"str": "", "comcode": "", "pcode": "", "abbr": "", "chiname": "", "position": []}}, "event": []}]}
         * company : {"message": [{"com": [{"abbr": "京东世纪贸易", "code": "", "idx": [{"abs_sen_id": 5, "abs_cut_id": 8}, {"abs_sen_id": 6, "abs_cut_id": 0}, {"abs_sen_id": 7, "abs_cut_id": 36}], "mkt": "N", "comcode": 872229, "chiname": "北京京东世纪贸易有限公司", "sim": 0.34375, "kw": ["京东"], "is_source": 0}], "seg": ["郎酒", "回应", "“", "处罚", "破价", "经销商", "和", "电商", "”", " ", "称", "渠道", "部门", "擅自决定", "#&#", "6月", "19日", "，", "郎酒", "官网", "发布声明", "回应", "“", "郎酒", "处罚", "破价", "经销商", "和", "电商平台", "”", "一事", "。", "郎酒", "解释", "称", "，", "该", "处罚", "行为", "是", "综合", "渠道", "事业部", "擅自决定", "，", "并", "未经", "公司", "同意", "和", "盖章", "发", "。", "目前", "公司", "已经", "否决", "这一", "做法", "，", "并", "进行", "内部", "追责", "处理", "。", "此前", "文件", "显示", "，", "6月", "16日", "凌晨", "，", "因", "郎酒", "“", "部分", "经销商", "出现", "了", "严重", "的", "线上", "破价", "违规行为", "，", "对", "市场", "造成", "了", "恶劣影响", "”", "，", "郎酒", "综合", "渠道", "事业部", "下发", "了", "《", "关于", "京东", "、", "天猫", "等", "部分", "经销商", "破价", "违规", "的", "处理", "通报", "》", "。", "通报", "显示", "，", "由", "北京", "宜信", "科创", "供货", "京东", "自营", "和", "苏宁", "自营", "的", "青花", "郎", "系列产品", "、", "红之欣", "供货", "天猫超市", "的", "青花", "郎", "系列产品", "及", "郎牌", "郎酒", "，", "严重", "突破", "了", "公司", "价格", "底线", "，", "鉴于", "其", "及时发现", "并", "处理", "，", "给予", "各自", "扣除", "违约金", "10万元", "的", "处罚", "。", "京东", "自营", "扣减", "年度", "规划", "费用", "总计", "100万元", "，", "天猫超市", "扣减", "年度", "规划", "费用", "总计", "60万元", "，", "苏宁", "自营", "扣减", "年度", "规划", "费用", "总计", "30万元", "。", "\", "n", """, " ", "+", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", """, " ", "新", "京报", "记者", "通过", "商品价格", "查询", "平台", "发现", "，", "在", "天猫超市", "与", "京东", "自营", "店中", "，", "青花", "郎", "53度", "500ml", "产品", "单", "瓶装", "的", "价格", "目前", "已经", "恢复", "至", "979元", "/", "瓶", "。", "而", "在", "618", "促销", "期间", "，", "一度", "下探", "到", "919元", "/", "瓶", "。", "\", "n", """, " ", "+", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", """, " ", "值得注意", "的", "是", "，", "在此之前", "，", "郎酒", "刚刚", "下达", "涨价", "通知", "，", "自", "6月", "1", "日起", "，", "53度", "青花", "郎", "、", "44.8度", "青花", "郎", "、", "39度", "青花", "郎", "的", "出厂价", "均", "上调", "79元", "/", "瓶", "。", "而", "根据", "5月", "21日", "郎酒", "青花", "郎", "事业部", "华北", "大区", "的", "通知", "，", "53度", "、", "44.8度", "的", "500ml", "青花", "郎", "团购", "统一", "报价", "上调", "为", "1059元", "/", "瓶", "，", "最低", "成交价", "959元", "/", "瓶", "。", "\", "n", """, " ", "+", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", """, " ", "郎酒", "综合", "渠道", "事业部", "的", "文件", "曝光", "后", "，", "迅速", "引起", "关注", "。", "郎酒", "也", "在", "6月", "19日", "发布声明", "回应", "，", "称", "对于", "上述", "经销商", "的", "处罚", "文件", "是", "综合", "渠道", "事业部", "的", "擅自决定", "，", "起草", "文稿", "未", "经过", "公司", "同意", "和", "盖章", "发出", "，", "公司", "规定", "所有", "对外", "文件", "须经", "公司", "审核", "同意", "并", "加盖", "公章", "方为", "有效", "。", "公司", "知悉", "后", "，", "否决", "了", "事业部", "的", "错误做法", "。", "郎酒", "对", "综合", "渠道", "事业部", "的", "这种", "行为", "进行", "了", "内部", "追责", "处理", "，", "要求", "所有", "部门", "必须", "依法", "、", "依规", "管理", "和", "经营", "市场", "。", "\", "n", """, " ", "+", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", """, " ", "酒水", "分析师", "蔡", "学飞", "表示", "，", "出现", "综合", "渠道", "事业部", "擅自", "做出", "处罚决定", "的", "原因", "，", "可能", "是因为", "郎酒", "一直", "在", "进行", "青花", "郎", "等", "产品", "的", "价格", "刚性", "管控", "，", "这是", "郎酒", "的", "长期", "核心", "目标", "，", "企业", "内部", "比较", "敏感", "，", "但", "此次", "综合", "渠道", "事业部", "有", "矫枉过正", "的", "嫌疑", "。"]}], "stat": 0, "version": "v0.5.5.7"}
         * industry : {"message": [], "stat": 0, "version": "v0.4.0.9"}
         * com_per_analysis : {"version": "v0.4.0.14", "stat": 0, "message": [{"com_list": [{"com": "京东世纪贸易", "code": "", "comcode": 872229, "chiname": "北京京东世纪贸易有限公司", "sentence": ["通报显示，由北京宜信科创供货京东自营和苏宁自营的青花郎系列产品、红之欣供货天猫超市的青花郎系列产品及郎牌郎酒，严重突破了公司价格底线，鉴于其及时发现并处理，给予各自扣除违约金10万元的处罚。", "京东自营扣减年度规划费用总计100万元，天猫超市扣减年度规划费用总计60万元，苏宁自营扣减年度规划费用总计30万元。", "\\n" +                 " 新京报记者通过商品价格查询平台发现，在天猫超市与京东自营店中，青花郎53度500ml产品单瓶装的价格目前已经恢复至979元/瓶。"], "sen_idx": [5, 6, 7], "pos": [2, 2, 0], "weight_list": [{"0": 0.0372, "1": 0.0051, "2": 0.9577}, {"0": 0.298, "1": 0.1929, "2": 0.5091}, {"0": 0.6933, "1": 0.2049, "2": 0.1018}], "general_pos": 2, "weights": {"0": 0.1676, "1": 0.099, "2": 0.7334}}], "per_list": []}]}
         * event : {"message": [{"name": "\u56de\u590d\u76d1\u7ba1\u5c42", "pos": 0, "cat": "\u6f84\u6e05\u56de\u590d"}], "stat": 0}
         * match_people : {"stat": 0, "message": [], "version": "v0.5.5.2"}
         * stock_clf : [0]
         */

        private String summary;
        private String product;
        private String concept;
        private String emotional;
        private String argument_analyze;
        private String company;
        private String industry;
        private String com_per_analysis;
        private String event;
        private String match_people;
        private String stock_clf;

        public String getSummary() {
            return summary;
        }

        public void setSummary(String summary) {
            this.summary = summary;
        }

        public String getProduct() {
            return product;
        }

        public void setProduct(String product) {
            this.product = product;
        }

        public String getConcept() {
            return concept;
        }

        public void setConcept(String concept) {
            this.concept = concept;
        }

        public String getEmotional() {
            return emotional;
        }

        public void setEmotional(String emotional) {
            this.emotional = emotional;
        }

        public String getArgument_analyze() {
            return argument_analyze;
        }

        public void setArgument_analyze(String argument_analyze) {
            this.argument_analyze = argument_analyze;
        }

        public String getCompany() {
            return company;
        }

        public void setCompany(String company) {
            this.company = company;
        }

        public String getIndustry() {
            return industry;
        }

        public void setIndustry(String industry) {
            this.industry = industry;
        }

        public String getCom_per_analysis() {
            return com_per_analysis;
        }

        public void setCom_per_analysis(String com_per_analysis) {
            this.com_per_analysis = com_per_analysis;
        }

        public String getEvent() {
            return event;
        }

        public void setEvent(String event) {
            this.event = event;
        }

        public String getMatch_people() {
            return match_people;
        }

        public void setMatch_people(String match_people) {
            this.match_people = match_people;
        }

        public String getStock_clf() {
            return stock_clf;
        }

        public void setStock_clf(String stock_clf) {
            this.stock_clf = stock_clf;
        }
    }
}